# ViewOrientation3D Class

---
Container for the point and vectors which define View3D's orientation.
SystemObject Autodesk.Revit.DBViewOrientation3D
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ViewOrientation3D : IDisposable

    Public Class ViewOrientation3D
    	Implements IDisposable

    public ref class ViewOrientation3D : IDisposable

    type ViewOrientation3D =
        class
            interface IDisposable
        end
The ViewOrientation3D type exposes the following members.
| Name| Description
---|---|---
| ViewOrientation3D|  Constructs a new ViewOrientation3D using the input eye position, up and forward directions.
Top
| Name| Description
---|---|---
| EyePosition|  The eye position point
| ForwardDirection|  The forward direction vector
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| UpDirection|  The up direction vector
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ViewOrientation3D
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace